bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
    /* Offset-cal window: hold balanced 0V (zero current) and average the op-amp
     * rest values, so id/iq are measured against the TRUE offset. spi_zcs
     * latches the measured ib offset — THE diagnostic for the CMP1/CMP2 fix:
     * ~2048 = op-amps un-railed and healthy; ~60/84 = still railed. */
    if (s_if_calCtr < IF_CAL_TICKS) {
        HAL_PWM_SetDutyFloat3Phase(0.5f, 0.5f, 0.5f);
        s_if_ia_acc += raw_ia;
        s_if_ib_acc += raw_ib;
        if (++s_if_calCtr >= IF_CAL_TICKS) {
            s_if_ia_off = (float)s_if_ia_acc / (float)IF_CAL_TICKS;
            s_if_ib_off = (float)s_if_ib_acc / (float)IF_CAL_TICKS;
            garudaData.speedPi.zcsSinceEnable = (uint16_t)s_if_ib_off;
        }
        return;
    }

    float ia   = IF_CURRENT_SIGN * ((float)raw_ia - s_if_ia_off) * IF_CURRENT_SCALE;
    float ib   = IF_CURRENT_SIGN * ((float)raw_ib - s_if_ib_off) * IF_CURRENT_SCALE;
    float vbus = if_raw_to_vbus(garudaData.vbusRaw);
    if (vbus < 1.0f) vbus = 1.0f;

    /* measure: 3-phase → αβ → dq at the forced angle */
    AlphaBeta_t iab;  clarke_transform(ia, ib, &iab);
    DQ_t idq;         park_transform(&iab, s_if_theta, &idq);

    /* regulate the current vector onto the forced d-axis (rotating field).
     * Soft-start: ramp the current reference up over the align window so the
     * rotor pulls into the forced frame gently (no step / no spike). */
    float frac = (s_if_alignCtr < IF_ALIGN_TICKS)
               ? ((float)s_if_alignCtr / (float)IF_ALIGN_TICKS) : 1.0f;
    float id_ref = (float)RT_IF_CURRENT_CA * 0.01f * frac;
    DQ_t vdq;
    vdq.d = pi_update(&s_if_pid_d, id_ref - idq.d, IF_DT_S);
    vdq.q = pi_update(&s_if_pid_q, 0.0f   - idq.q, IF_DT_S);

    /* dq → αβ → SVPWM duties (centered; effective V can be < MIN_DUTY) */
    AlphaBeta_t vab;  inv_park_transform(&vdq, s_if_theta, &vab);
    float da, db, dc;
    svpwm_update(vab.alpha, vab.beta, vbus, &da, &db, &dc);
    HAL_PWM_SetDutyFloat3Phase(da, db, dc);

    /* DIAG: spi_target=id_ref(mA), spi_error=id_meas(mA), spi_integ=vd(V),
     * spi_output=omega(rad/s), spi_zcs=ib offset. */
    garudaData.speedPi.lastTarget  = (uint32_t)(id_ref  * 1000.0f);
    garudaData.speedPi.lastError   = (int32_t) (idq.d   * 1000.0f);
    garudaData.speedPi.integratorF = vdq.d;
    garudaData.speedPi.outputDuty  = (uint32_t)(s_if_omega);

    /* align first (hold angle so the rotor settles), then ramp speed */
    if (s_if_alignCtr < IF_ALIGN_TICKS) {
        s_if_alignCtr++;
    } else if (s_if_omega < IF_HANDOFF_RAD_S) {
        float omega_dot = IF_ERPM_TO_RAD_S(RT_IF_RAMP_ERPM_PER_S);
        s_if_omega += omega_dot * IF_DT_S;
        if (s_if_omega >= IF_HANDOFF_RAD_S) {
            s_if_omega     = IF_HANDOFF_RAD_S;
            s_if_atHandoff = true;       /* M1: hold here; M2 will hand to 6-step */
        }
    }
    s_if_theta += s_if_omega * IF_DT_S;
    if (s_if_theta >  3.14159265f) s_if_theta -= 6.28318531f;
    if (s_if_theta < -3.14159265f) s_if_theta += 6.28318531f;
}
#endif /* FEATURE_IF_STARTUP */

#if FEATURE_CL_DIFF_IDLE || FEATURE_CL_COAST_VERIFY
/* ── Coast-listen lock acquisition (2026-06-10) ──────────────────────────
 * At CL entry, instead of trusting the morph's lock (bench: the morph can
 * drag a SLIPPING rotor while its gate claims 3k lock — coast-listen caught
 * it at ~900 real), CUT THE BRIDGE for up to ~2 electrical cycles and listen
 * to phase B's clean BEMF — no PWM means no threshold model at all. The
 * median of the crossing intervals is the true period (one B-crossing every
 * half e-cycle = 3 sector periods); the last crossing's polarity gives the
 * sector exactly (B floats rising in step 2, falling in step 5; ZC = sector
 * center). Engage SYNCED at the crossing instant — differential drive when
 * FEATURE_CL_DIFF_IDLE, the conventional waveform otherwise (verify mode).
 * Same primitive AM32/BLHeli use to catch a spinning motor. Windage decel
 * over the window is negligible (morph coast measurements). The first ~3ms
 * after bridge-cut freewheel through the body diodes and ring the phases —
 * settle past it and reject impossible intervals. direction!=0 → no coast. */
#define CL_COAST_MIN_CROSS      3     /* crossings needed (=> 2 valid intervals) */
#define CL_COAST_MAX_IV         4     /* intervals stored for the median */
#define CL_COAST_TIMEOUT_TICKS  4500  /* ~100ms @45kHz — then blind fallback engage */
#define CL_COAST_SETTLE_TICKS   150   /* ~3.3ms: at bridge-cut the winding current
                                       * FREEWHEELS through the body diodes, slamming
                                       * the phase to the rails — ring-crossings.
                                       * (Bench 2026-06-10: 12-tick settle let a
                                       * synced-morph cut measure HALF the true
                                       * interval → 2× engage → +22A OC.) */
#define CL_COAST_IV_MIN         150   /* reject intervals implying > ~9k eRPM —
                                       * impossible coming from the ~3k morph;
                                       * those are ringing/noise, not BEMF */
#define CL_COAST_HYST           8     /* ADC counts hysteresis about the mean */

static struct {
    uint8_t  active;
    uint8_t  side;          /* 1=above mean, 0=below, 0xFF=not yet primed */
    uint8_t  nCross;        /* crossings seen */
    uint8_t  nIv;           /* intervals captured */
    uint8_t  lastRising;    /* polarity of last crossing */
    uint16_t tick;          /* ticks since coast start */
    uint16_t lastCrossTick;
    uint16_t mean;          /* running mean of phase-B = rest level estimate */
    uint16_t iv[CL_COAST_MAX_IV];
} s_clCoast;

#if FEATURE_CL_ENTRY_GLIDE
/* Entry-glide state: after the coast engage, effective duty (diff waveform)
 * ramps linearly from the speed-matched level to MIN_DUTY, then the drive
 * force-swaps to the conventional waveform (baseline from there on). */
static uint8_t  s_glideActive;
static uint8_t  s_glideDivCtr;

static uint16_t s_glideDuty;
#endif

static void CL_CoastBegin(void)
{
#if FEATURE_CL_ENTRY_GLIDE
    s_glideActive = 0;
#endif
    s_clCoast.active = 1;
    s_clCoast.side = 0xFF;
    s_clCoast.nCross = 0;
    s_clCoast.nIv = 0;
    s_clCoast.tick = 0;
    s_clCoast.lastCrossTick = 0;
    s_clCoast.mean = 0;
    HAL_MC1PWMDisableOutputs();   /* true coast: all phases Hi-Z (clears diff flag) */
}

/* Re-engage drive at `sector`, period `p`, next commutation in `dl` ticks,
 * marked synced. Mirrors the morph→CL exit seeding. */
static void CL_CoastEngage(uint8_t sector, uint16_t p, uint16_t dl, uint16_t now)
{
#if FEATURE_CL_ENTRY_GLIDE
    /* Glide engage: diff waveform at effective volts MATCHED to the measured
     * speed (duty = MIN_DUTY × erpm / equilibrium-erpm) — torque step at
     * engage ≈ 0, then the per-tick glide ramps duty to MIN_DUTY. */
    {
        uint32_t erpm = ERPM_FROM_ADC_STEP_NUM / p;
        uint32_t d = ((uint32_t)MIN_DUTY * erpm) / CL_GLIDE_EQ_ERPM;
        if (d > (uint32_t)MIN_DUTY)      d = MIN_DUTY;
        if (d < (uint32_t)MIN_DUTY / 4u) d = (uint32_t)MIN_DUTY / 4u;
        g_pwmDiffLow = 1;
        COMMUTATION_ApplyStep(&garudaData, sector);
        garudaData.duty = (uint16_t)d;
        HAL_PWM_SetDutyCycle(garudaData.duty);
        s_glideDuty   = (uint16_t)d;
        s_glideDivCtr = 0;
        s_glideActive = 1;
    }
#elif FEATURE_CL_DIFF_IDLE
    g_pwmDiffLow = 1;
    COMMUTATION_ApplyStep(&garudaData, sector);
    /* Engage GENTLY at the idle floor: the rotor is already at speed and only
     * needs holding volts. (Engaging at MIN_DUTY — which the deadtime comp
     * turns into a ~16% active pulse — caused a −21A blip at engage.) */
    garudaData.duty = CL_DIFF_IDLE_FLOOR;
    HAL_PWM_SetDutyCycle(garudaData.duty);
#else
    /* Verify mode: conventional waveform, same entry duty the morph coast
     * used (MIN_DUTY) — identical volts to today's hot hand-off, but at the
     * MEASURED sector and period instead of the morph's possibly-fictional
     * lock state. */
    COMMUTATION_ApplyStep(&garudaData, sector);
    garudaData.duty = MIN_DUTY;
    HAL_PWM_SetDutyCycle(garudaData.duty);
#endif
    BEMF_ZC_OnCommutation(&garudaData, now);

