bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
            ma = ((int32_t)garudaData.phaseCurrent.iaRaw - 2048) * 1000 / 93;
            if (ma > 32767)  ma = 32767;
            if (ma < -32768) ma = -32768;
            ss.ia = (int16_t)ma;

            ma = ((int32_t)garudaData.phaseCurrent.ibRaw - 2048) * 1000 / 93;
            if (ma > 32767)  ma = 32767;
            if (ma < -32768) ma = -32768;
            ss.ib = (int16_t)ma;

#if FEATURE_HW_OVERCURRENT
            ma = ((int32_t)garudaData.ibusRaw - 2048) * 1000 / 93;
            if (ma > 32767)  ma = 32767;
            if (ma < -32768) ma = -32768;
            ss.id = (int16_t)ma;
#else
            ss.id = 0;
#endif
            ss.iq       = 0;
            ss.vd       = (int16_t)(garudaData.vbusRaw);      /* raw ADC */
            ss.vq       = (int16_t)(garudaData.bemf.zcThreshold);
            ss.theta    = (int16_t)(garudaData.currentStep);
            ss.obs_x1   = (int16_t)(garudaData.bemf.bemfRaw);
            ss.obs_x2   = 0;
            {
                uint32_t erpm_hr = (garudaData.hwzc.enabled && garudaData.hwzc.stepPeriodHR)
                                 ? HWZC_TICKS_TO_ERPM(garudaData.hwzc.stepPeriodHR)
                                 : 0;
                int32_t eRPMscaled = (int32_t)(erpm_hr / 10);
                if (eRPMscaled > 32767) eRPMscaled = 32767;
                ss.omega = (int16_t)eRPMscaled;
            }
            {
                uint32_t dutyPctX100 = (garudaData.duty * 10000U) / LOOPTIME_TCY;
                if (dutyPctX100 > 32767) dutyPctX100 = 32767;
                ss.mod_index = (int16_t)dutyPctX100;
            }
            ss.flags  = (garudaData.hwzc.enabled ? 0x01 : 0x00)
                      | ((garudaData.state == ESC_FAULT) ? 0x02 : 0x00);
            ss.state  = (uint8_t)garudaData.state;
            ss.tick_lsb = (uint16_t)(garudaData.systemTick & 0xFFFF);
            Scope_WriteSample(&ss);
        }
#endif /* FEATURE_BURST_SCOPE */
    }
#endif
#else
#if !FEATURE_FOC && !FEATURE_FOC_V2 && !FEATURE_FOC_V3 && !FEATURE_FOC_AN1078
    garudaData.bemf.bemfRaw = phaseB_val;
    (void)phaseAC_val;  /* AD2CH0DATA must be read; suppress unused warning */
#endif
#endif

    /* Bus voltage fault enforcement (OV/UV) */
#if FEATURE_VBUS_FAULT
    {
        static uint8_t vbusOvCount = 0, vbusUvCount = 0;

        if ((garudaData.state >= ESC_ALIGN && garudaData.state <= ESC_CLOSED_LOOP)
            || garudaData.state == ESC_IF_RAMP)   /* I-f spin-up: keep OV/UV active */
        {
            if (garudaData.vbusRaw > RT_VBUS_OVERVOLTAGE_ADC)
            {
                if (++vbusOvCount >= VBUS_FAULT_FILTER)
                {
#if FEATURE_ADC_CMP_ZC
                    if (garudaData.hwzc.enabled)
                        HWZC_Disable(&garudaData);
                    garudaData.hwzc.fallbackPending = false;
#endif
#if FEATURE_HW_OVERCURRENT
                    HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
                    HAL_MC1PWMDisableOutputs();
                    garudaData.state = ESC_FAULT;
                    garudaData.faultCode = FAULT_OVERVOLTAGE;
                    garudaData.runCommandActive = false;
                    LED2 = 0;
                }
            }
            else { vbusOvCount = 0; }

            {
                /* Determine UV threshold: relaxed during pre-sync startup to
                 * tolerate bus sag from CC-limited bench supply. Normal
                 * threshold resumes after ZC sync is achieved. */
                uint16_t uvThreshold = RT_VBUS_UNDERVOLTAGE_ADC;
#if FEATURE_PRESYNC_RAMP
                if (garudaData.state <= ESC_OL_RAMP
                    || (garudaData.state == ESC_CLOSED_LOOP
                        && !garudaData.timing.zcSynced))
                    uvThreshold = RT_VBUS_UV_STARTUP_ADC;
#endif

            if (garudaData.vbusRaw < uvThreshold)
            {
                if (++vbusUvCount >= VBUS_FAULT_FILTER)
                {
#if FEATURE_ADC_CMP_ZC
                    if (garudaData.hwzc.enabled)
                        HWZC_Disable(&garudaData);
                    garudaData.hwzc.fallbackPending = false;
#endif
#if FEATURE_HW_OVERCURRENT
                    HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
                    HAL_MC1PWMDisableOutputs();
                    garudaData.state = ESC_FAULT;
                    garudaData.faultCode = FAULT_UNDERVOLTAGE;
                    garudaData.runCommandActive = false;
                    LED2 = 0;
                }
            }
            else { vbusUvCount = 0; }
            } /* uvThreshold scope */
        }
        else
        {
            vbusOvCount = 0;
            vbusUvCount = 0;
        }
    }
#endif

    /* Bus current sensing and overcurrent protection */
#if FEATURE_HW_OVERCURRENT
#if FEATURE_OC_AUTOZERO
    /* Read AD1CH2DATA — clears data-ready (mandatory on dsPIC33AK) — then
     * re-center into the 2048 frame that every threshold, the window tracker
     * and the host decoder assume. The chain's TRUE rest is ~78 counts, so
     * the correction is ≈ +1970 (no-op until the ARMED cal measures it).
     * Saturates at 4095 ≈ +22A — beyond that is CMP3 hardware territory. */
    {
        uint16_t rawBus = ADCBUF_IBUS;
        s_ocZeroRaw = rawBus;                       /* for the ARMED cal */
        int32_t corr = (int32_t)rawBus + (2048 - (int32_t)g_ocBiasAdc);
        if (corr < 0)    corr = 0;
        if (corr > 4095) corr = 4095;
        garudaData.ibusRaw = (uint16_t)corr;
    }
#else
    /* Read AD1CH2DATA — clears data-ready (mandatory on dsPIC33AK) */
    garudaData.ibusRaw = ADCBUF_IBUS;
#endif

    /* Track peak for diagnostics */
    if (garudaData.ibusRaw > garudaData.ibusMax)
        garudaData.ibusMax = garudaData.ibusRaw;

    /* Count CLPCI activity via CLEVT latched event flags.
     * Poll all 3 generators — active PWM phase rotates with commutation.
     * Coarse counter: one 41.7us ADC tick may collapse multiple chop events. */
#if (OC_PROTECT_MODE == 0 || OC_PROTECT_MODE == 2) && OC_CLPCI_ENABLE
    if (PCI_CLIMIT_EVT_PG1 || PCI_CLIMIT_EVT_PG2 || PCI_CLIMIT_EVT_PG3)
    {
        garudaData.clpciTripCount++;
        /* Clear W1C event flags via direct register write (not bitfield RMW)
         * to avoid accidentally clearing other W1C bits in PGxSTAT. */
        PG1STAT = PCI_CLIMIT_EVT_MASK;
        PG2STAT = PCI_CLIMIT_EVT_MASK;
        PG3STAT = PCI_CLIMIT_EVT_MASK;
    }
#endif

#ifdef ENABLE_PWM_FAULT_PCI
    /* Count transient FPCI trips via FLTEVT latched event flags.
     * With TERM=1 (auto-terminate), board FPCI trips that resolve within
     * one PWM cycle never set FLTACT by the time the ISR runs — but
     * FLTEVT latches the event. Non-zero count = duty being chopped. */
    if (PCI_FAULT_EVT_PG1 || PCI_FAULT_EVT_PG2 || PCI_FAULT_EVT_PG3)
    {
        garudaData.fpciTripCount++;
        PG1STAT = PCI_FAULT_EVT_MASK;
        PG2STAT = PCI_FAULT_EVT_MASK;
        PG3STAT = PCI_FAULT_EVT_MASK;
    }
#endif

    /* Software hard fault — immediate shutdown (Mode 2 only).
     * DEBOUNCED 3 consecutive samples (2026-06-10): a single garbage bus-ADC
     * sample (the readout spikes to the rail at random transition moments —
     * bench: +22A reads with the bridge OFF) was latching phantom OC_SW and
     * killing healthy runs. Real overcurrent is sustained for ≫3 ADC ticks
     * (~67µs), and the truly fast events belong to the CMP3 HARDWARE
     * comparator layer anyway — the software check is the slow backstop. */
#if OC_PROTECT_MODE == 2
    {
        static uint8_t s_ocFaultDebounce = 0;
        if (garudaData.ibusRaw > OC_FAULT_ADC_VAL)
        {
            if (s_ocFaultDebounce < 255u) s_ocFaultDebounce++;
        }
        else
            s_ocFaultDebounce = 0;

    if (s_ocFaultDebounce >= 3u
        && ((garudaData.state >= ESC_ALIGN
             && garudaData.state <= ESC_CLOSED_LOOP)
            || garudaData.state == ESC_IF_RAMP))   /* protect I-f spin-up too */
    {
#if FEATURE_ADC_CMP_ZC
        if (garudaData.hwzc.enabled)
            HWZC_Disable(&garudaData);
        garudaData.hwzc.fallbackPending = false;
#endif
        HAL_MC1PWMDisableOutputs();
        garudaData.state = ESC_FAULT;
        garudaData.faultCode = FAULT_OVERCURRENT;
        garudaData.runCommandActive = false;
        LED2 = 0;
    }
    }  /* debounce scope */
#endif
#endif /* FEATURE_HW_OVERCURRENT */

#if FEATURE_FOC
    /* ── FOC control path — replaces ENTIRE 6-step state machine ──
     * Architecture from RK1 (proven on A2212 1400KV):
     *   - Inline modular calls (no MCAPP_FOCStateMachine black box)
     *   - V/f voltage-mode with gradual PLL angle correction
     *   - POT=0 → motor coasts to stop; POT>0 → resumes (no re-arm)
     *   - No ESC_RUNNING state — PLL correction makes CL implicit
     */
    {
        /* Convert ADC counts → physical units using calibrated offsets */
        float ia    = counts_to_amps_cal(raw_ia, s_ia_offset);
        float ib    = counts_to_amps_cal(raw_ib, s_ib_offset);
        s_vbus      = counts_to_vbus(garudaData.vbusRaw);

        /* Dynamic PI voltage clamp — must match circular limiter (Vbus/sqrt(3))
         * so anti-windup engages at the real output ceiling, not 1.73x above it. */
        {
            float vclamp = s_vbus * 0.95f * 0.577350269f;
            s_pid_d.out_max =  vclamp;
            s_pid_d.out_min = -vclamp;
            s_pid_q.out_max =  vclamp;
            s_pid_q.out_min = -vclamp;
        }

        /* Throttle source: use garudaData.throttle (already muxed above) */
        uint16_t throttle_raw = garudaData.throttle;

        /* State dispatch */
        ESC_STATE_T state = garudaData.state;

