bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
#if FEATURE_HW_OVERCURRENT
                /* SW OC soft limiter — same as CL (proportional duty cut) */
                if (garudaData.ibusRaw > OC_SW_LIMIT_ADC)
                {
                    uint16_t excess = garudaData.ibusRaw - OC_SW_LIMIT_ADC;
                    uint16_t range = RT_OC_CMP3_DAC_VAL - OC_SW_LIMIT_ADC;
                    if (range == 0) range = 1;
                    uint32_t reduction = ((uint32_t)excess
                        * (garudaData.duty - MIN_DUTY)) / range;
                    if (reduction >= garudaData.duty - MIN_DUTY)
                        garudaData.duty = MIN_DUTY;
                    else
                        garudaData.duty -= reduction;
                }
#endif
                HAL_PWM_SetDutyCycle(garudaData.duty);
            }

            /* Absolute timeout — covers BOTH sub-phases.
             * If motor stalls during CONVERGE (e.g. prop overload),
             * this is the only exit path. */
            if ((garudaData.systemTick
                - garudaData.morph.entryTick) > MORPH_TIMEOUT_MS)
            {
                HAL_MC1PWMDisableOutputs();
#if FEATURE_HW_OVERCURRENT
                HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
                garudaData.state = ESC_FAULT;
                garudaData.faultCode = FAULT_MORPH_TIMEOUT;
                garudaData.runCommandActive = false;
                LED2 = 0;
            }
            break;
        }
#else
        case ESC_ALIGN:
        case ESC_OL_RAMP:
            break;
#endif

#if DIAGNOSTIC_MANUAL_STEP
        case ESC_CLOSED_LOOP:
            /* Manual step mode: ADC ISR just holds duty. No automatic commutation. */
            HAL_PWM_SetDutyCycle(garudaData.duty);
            break;
#elif FEATURE_BEMF_CLOSED_LOOP
        case ESC_CLOSED_LOOP:
        {
            /* Throttle-zero shutdown: if pot returns to zero after being raised,
             * gracefully stop. Don't wait for desync — at low duty the HW ZC
             * comparator can trigger on noise indefinitely, keeping the motor
             * in a stalled-but-"running" state (audible buzz).
             *
             * hasSeenThrottle prevents false shutdown at CL entry — the arming
             * gate requires pot=0, so pot is still at zero when CL starts.
             * Only arm the shutdown after the user has raised the pot once. */
            {
                static bool hasSeenThrottle = false;
                static uint16_t zeroThrottleCount = 0;

                if (prevAdcState != ESC_CLOSED_LOOP)
                {
                    hasSeenThrottle = false;
                    zeroThrottleCount = 0;
                }

                if (garudaData.throttle >= ARM_THROTTLE_ZERO_ADC)
                    hasSeenThrottle = true;

#if FEATURE_THROTTLE_ZERO_AUTO_DISARM
                if (hasSeenThrottle && garudaData.throttle < ARM_THROTTLE_ZERO_ADC)
                {
                    if (++zeroThrottleCount >= (PWMFREQUENCY_HZ / 20))  /* 50ms */
                    {
#if FEATURE_ADC_CMP_ZC
                        if (garudaData.hwzc.enabled)
                            HWZC_Disable(&garudaData);
                        garudaData.hwzc.fallbackPending = false;
#endif
#if FEATURE_HW_OVERCURRENT
                        HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
                        HAL_MC1PWMDisableOutputs();
                        garudaData.runCommandActive = false;
                        garudaData.state = ESC_IDLE;
                        LED2 = 0;
                        zeroThrottleCount = 0;
                        break;
                    }
                }
                else
                {
                    zeroThrottleCount = 0;
                }
#else
                /* Throttle-zero auto-disarm disabled — motor keeps running at
                 * CL_IDLE_DUTY when pot is at zero. Use GSP stop or power cycle
                 * to stop the motor. */
                (void)hasSeenThrottle;
                (void)zeroThrottleCount;
#endif
            }

            /* Detect first entry into CLOSED_LOOP (state transition) */
            if (prevAdcState != ESC_CLOSED_LOOP)
            {
#if FEATURE_ADC_CMP_ZC && FEATURE_HWZC_HANDOFF_DAMP
                /* Arm the hand-off period-collapse damp for the first N
                 * commutations (prevents the half-period phantom at entry). */
                garudaData.hwzc.handoffDamp = HWZC_HANDOFF_DAMP_EVENTS;
#endif
#if FEATURE_SINE_STARTUP
                /* Morph hot handoff: ZC already locked, skip re-init.
                 * Gate on prevAdcState == ESC_MORPH (not just zcSynced)
                 * to prevent stale state from a previous run triggering
                 * the hot-handoff path from OL_RAMP. */
                if (prevAdcState == ESC_MORPH
                    && garudaData.timing.zcSynced)
                {
                    garudaData.desyncRestartAttempts = 0;
#if FEATURE_HW_OVERCURRENT
                    HAL_CMP3_SetThreshold(RT_OC_CMP3_DAC_VAL);
#endif
#if FEATURE_ADC_CMP_ZC
                    garudaData.hwzc.fallbackPending = false;
                    garudaData.hwzc.enablePending = false;
                    garudaData.hwzc.dbgLatchDisable = false;
#endif
                }
                else
#endif
                {
                    /* Normal CL entry (from OL_RAMP or morph without lock) */
                    uint16_t initPeriod = TIMER1_TO_ADC_TICKS(garudaData.rampStepPeriod);
                    if (initPeriod < MIN_ADC_STEP_PERIOD)
                        initPeriod = MIN_ADC_STEP_PERIOD;
                    if (initPeriod > RT_INITIAL_ADC_STEP_PERIOD)
                        initPeriod = RT_INITIAL_ADC_STEP_PERIOD;
                    BEMF_ZC_Init(&garudaData, initPeriod);
                    BEMF_ZC_OnCommutation(&garudaData, adcIsrTick);
                    garudaData.bemf.ad2SettleCount = ZC_AD2_SETTLE_SAMPLES;
#if FEATURE_ADC_CMP_ZC
                    /* Clear stale HWZC state from any prior run */
                    garudaData.hwzc.fallbackPending = false;
                    garudaData.hwzc.enablePending = false;
                    garudaData.hwzc.dbgLatchDisable = false;

#if FEATURE_PRESYNC_RAMP
                    /* Defensively disable HWZC: stale hwzc.enabled=true from a
                     * prior run (e.g. desync recovery) would skip the entire SW
                     * pre-sync block (line ~479 gates on !hwzc.enabled). Force
                     * HWZC off so pre-sync runs. Clear fallbackPending to prevent
                     * stale HWZC state from re-seeding SW ZC. */
                    if (garudaData.hwzc.enabled)
                        HWZC_Disable(&garudaData);
                    garudaData.hwzc.fallbackPending = false;
#else
                    /* Immediate HWZC enable for motors with reliable OL ramp
                     * delivery speed (non-presync-ramp path). */
                    {
                        uint32_t curErpm = ERPM_FROM_ADC_STEP_NUM / initPeriod;
                        if (curErpm >= RT_HWZC_CROSSOVER_ERPM
#if FEATURE_CL_DIFF_IDLE
                            && !g_pwmDiffLow   /* HWZC invalid under diff drive */
#endif
                           )
                        {
                            HWZC_Enable(&garudaData);
                        }
                    }
#endif

#if FEATURE_AM32_STARTUP
                    if (g_am32EntryPending)
                    {
                        g_am32EntryPending = 0;
                        garudaData.sine.active = false;
                        /* One blind commutation from the UNKNOWN rotor angle
                         * (AM32 does exactly this — worst case zero torque on
                         * the first step; the listener sorts it out). */
                        COMMUTATION_ApplyStep(&garudaData,
                            (uint8_t)((garudaData.currentStep + 1u) % 6u));
                        garudaData.duty = MIN_DUTY;
                        HAL_PWM_SetDutyCycle(garudaData.duty);
                        if (!garudaData.hwzc.enabled)
                            HWZC_Enable(&garudaData);
                        /* Trust the listener from event 1: capture-driven PI
                         * immediately, no blind phase, no sync gate. */
                        garudaData.timing.zcSynced = true;
                        garudaData.timing.goodZcCount =
                            (uint16_t)RT_ZC_SYNC_THRESHOLD;
                    }
#endif
#if FEATURE_PLL_STARTUP
                    if (garudaData.hwzc.pllStartActive)
                    {
                        /* Engage 6-step from the align angle and start the
                         * blind PLL schedule: comparator armed from the
                         * first commutation, captures gated in hwzc.c. */
                        garudaData.sine.active = false;
                        /* rotor is parked AT the align vector = step s0's
                         * center → applying s0 gives ~zero torque. Lead by
                         * one step (60°) so the schedule pulls forward. */
                        uint8_t s0 = STARTUP_SineGetTransitionStep(&garudaData);
                        COMMUTATION_ApplyStep(&garudaData, (uint8_t)((s0 + 1u) % 6u));
                        garudaData.duty = MIN_DUTY;
                        HAL_PWM_SetDutyCycle(garudaData.duty);
                        if (!garudaData.hwzc.enabled)
                            HWZC_Enable(&garudaData);
                    }
#endif
#endif
                }
            }

