bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
                            if (absDiff <= (int16_t)tol)
                                garudaData.integ.shadowHitCount++;
                            else
                                garudaData.integ.shadowMissCount++;
                        }
                        else
                        {
                            garudaData.integ.shadowNoFireCount++;
                            garudaData.integ.shadowMissCount++;
                            garudaData.integ.shadowVsActual = SHADOW_NO_FIRE_SENTINEL;
                        }
                    }
#endif
#if FEATURE_ADC_CMP_ZC
                    /* Snapshot deadlineIsZc BEFORE AdvanceStep clears it (Rule 14) */
                    bool wasZcDeadline = garudaData.timing.deadlineIsZc;
#endif
                    COMMUTATION_AdvanceStep(&garudaData);
                    BEMF_ZC_OnCommutation(&garudaData, adcIsrTick);
                    BEMF_ZC_HandleUndetectableStep(&garudaData, adcIsrTick);

#if FEATURE_ADC_CMP_ZC
                    /* enablePending hook: hand off to hardware ZC at true-ZC
                     * commutation boundary only (Rule 12) */
                    if (garudaData.hwzc.enablePending && wasZcDeadline)
                    {
                        HWZC_Enable(&garudaData);
                        goto cl_duty_control;
                    }
#endif
                }

                /* Timeout watchdog */
                ZC_TIMEOUT_RESULT_T toResult = BEMF_ZC_CheckTimeout(&garudaData, adcIsrTick);
                if (toResult == ZC_TIMEOUT_DESYNC)
                {
                    garudaData.zcDiag.zcDesyncCount++;
#if FEATURE_HW_OVERCURRENT
                    HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
#if FEATURE_DESYNC_RECOVERY
                    if (garudaData.runCommandActive
#if !FEATURE_THROTTLE_ZERO_AUTO_DISARM
                        || true   /* AUTO_DISARM=0: stay in the run loop even
                                   * if some earlier path cleared the flag.
                                   * Re-arm here so the recovery exit can
                                   * restart instead of falling to IDLE. */
#endif
                       )
                    {
#if !FEATURE_THROTTLE_ZERO_AUTO_DISARM
                        garudaData.runCommandActive = true;
#endif
                        HAL_MC1PWMDisableOutputs();
                        garudaData.state = ESC_RECOVERY;
                        garudaData.recoveryCounter = RT_DESYNC_COAST_COUNTS;
                        LED2 = 0;
                    }
                    else
                    {
                        HAL_MC1PWMDisableOutputs();
                        garudaData.desyncRestartAttempts = 0;
                        garudaData.state = ESC_IDLE;
                        LED2 = 0;
                    }
#else
                    garudaData.state = ESC_FAULT;
                    garudaData.faultCode = FAULT_DESYNC;
                    HAL_MC1PWMDisableOutputs();
                    LED2 = 0;
#endif
                }
                else if (toResult == ZC_TIMEOUT_FORCE_STEP)
                {
#if FEATURE_BEMF_INTEGRATION
                    garudaData.integ.shadowSkipCount++;
#endif
                    garudaData.zcDiag.zcTimeoutForceCount++;
                    {
                        uint8_t s = garudaData.currentStep;
                        if (garudaData.timing.stepMissCount[s] < 255)
                            garudaData.timing.stepMissCount[s]++;
                    }
                    COMMUTATION_AdvanceStep(&garudaData);
                    BEMF_ZC_OnCommutation(&garudaData, adcIsrTick);
                    BEMF_ZC_HandleUndetectableStep(&garudaData, adcIsrTick);

                    if (garudaData.timing.goodZcCount == 0)
                    {
                        garudaData.timing.zcSynced = false;
                        garudaData.timing.hasPrevZc = false;
                        uint16_t initPeriod = TIMER1_TO_ADC_TICKS(garudaData.rampStepPeriod);
                        if (initPeriod < RT_MIN_ADC_STEP_PERIOD)
                            initPeriod = RT_MIN_ADC_STEP_PERIOD;
                        garudaData.timing.stepPeriod = initPeriod;
                        garudaData.timing.forcedCountdown = initPeriod;
#if FEATURE_PRESYNC_RAMP
                        /* Reset duty to ramp level to prevent ratchet:
                         * post-sync CL_IDLE floor inflates duty, and pre-sync
                         * holds mappedDuty=garudaData.duty. Without reset,
                         * each sync→unsync cycle pumps duty higher, driving
                         * massive current through low-R motor. */
                        garudaData.duty = RT_RAMP_DUTY_CAP;
#endif
                    }
                }
            }

#if FEATURE_ADC_CMP_ZC
            }
            else
            {
                /* hwzc.enabled=true: software ZC block skipped.
                 * SCCP1 ISR + comparator ISR handle commutation. */

                /* No speed-drop fallback: once HW ZC activates, it stays
                 * active at all speeds. The ADC comparator works fine at low
                 * eRPM (24kHz samples → plenty per step). Only miss-limit
                 * triggers fallback (error condition). This eliminates the
                 * HW→SW transition jerk during normal deceleration. */

                /* Promote zcSynced once HWZC has confirmed good ZCs.
                 * This unlocks pot-mapped duty (CL_IDLE_DUTY floor)
                 * and MAX_DUTY cap instead of RAMP_DUTY_CAP. */
                if (!garudaData.timing.zcSynced
#if FEATURE_PLL_STARTUP
                    /* during the PLL blind ramp, sync is declared ONLY by
                     * HWZC_PllStartTick's gated-capture handover — raw
                     * goodZcCount here counts low-speed phantoms */
                    && !garudaData.hwzc.pllStartActive
#endif
                    && garudaData.hwzc.goodZcCount >= RT_ZC_SYNC_THRESHOLD)
                {
                    garudaData.timing.zcSynced = true;
                    garudaData.desyncRestartAttempts = 0;
#if FEATURE_HW_OVERCURRENT
                    HAL_CMP3_SetThreshold(RT_OC_CMP3_DAC_VAL);
#endif
                }

                /* Plausibility stall check: if stepPeriodHR is at the IIR
                 * floor (motor apparently at max eRPM) but duty is low,
                 * the motor is physically stalled and HWZC is tracking PWM
                 * switching noise. Debounced to avoid false triggers during
                 * brief transients. Gated on zcSynced to skip post-handoff. */
                {
                    static uint16_t hwzcStallCount = 0;
                    if (prevAdcState != ESC_CLOSED_LOOP)
                        hwzcStallCount = 0;

                    if (garudaData.hwzc.stepPeriodHR <= RT_HWZC_MIN_STEP_TICKS
                        && garudaData.duty < HWZC_STALL_DUTY_LIMIT
                        && garudaData.timing.zcSynced)
                    {
                        if (++hwzcStallCount >= HWZC_STALL_DEBOUNCE_TICKS)
                        {
                            garudaData.hwzc.goodZcCount = 0;
                            garudaData.hwzc.dbgLatchDisable = true;
                            HWZC_Disable(&garudaData);
                            hwzcStallCount = 0;
                        }
                    }
                    else
                    {
                        hwzcStallCount = 0;
                    }
                }

                /* No-capture watchdog: independent of the period/duty stall
                 * check above. If hwzc.totalZcCount hasn't moved for N ticks
                 * while zcSynced is set, the motor is physically stalled
                 * (autonomous SCCP1 timer keeps commutating on the last
                 * known period but no real BEMF edges arrive). The standard
                 * BEMF_ZC_CheckTimeout doesn't see this because lastCommTick
                 * is updated by the autonomous timer's HWZC_OnCommutation
                 * call. Force DESYNC → RECOVERY here so the pot-zero idle
                 * path can recover via the regular restart cycle. */
                {
                    static uint32_t lastZcCount = 0;
                    static uint16_t noCapCount = 0;
                    if (prevAdcState != ESC_CLOSED_LOOP) {
                        lastZcCount = garudaData.hwzc.totalZcCount;
                        noCapCount = 0;
                    }
                    if (garudaData.hwzc.enabled && garudaData.timing.zcSynced)
                    {
                        if (garudaData.hwzc.totalZcCount != lastZcCount)
                        {
                            lastZcCount = garudaData.hwzc.totalZcCount;
                            noCapCount = 0;
                        }
                        else if (++noCapCount >= HWZC_NO_CAPTURE_TICKS)
                        {
                            /* Mirror the desync-handler path so the pot-zero
                             * recovery loop kicks in cleanly. */
                            garudaData.zcDiag.zcDesyncCount++;
#if FEATURE_HW_OVERCURRENT
                            HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
                            HAL_MC1PWMDisableOutputs();
#if !FEATURE_THROTTLE_ZERO_AUTO_DISARM
                            garudaData.runCommandActive = true;
#endif
                            garudaData.state = ESC_RECOVERY;
                            garudaData.recoveryCounter = RT_DESYNC_COAST_COUNTS;
                            LED2 = 0;
                            noCapCount = 0;
                        }
                    }
                    else
                    {
                        noCapCount = 0;
                    }
                }

#if FEATURE_BEMF_INTEGRATION
                /* Read-only observer: keep shadow integration warm (Rule 11) */
                {
                    bool newComm = (garudaData.hwzc.commSeq
                                    != garudaData.hwzc.obsCommSeq);
                    if (newComm)
                    {
                        garudaData.hwzc.obsCommSeq =
                            garudaData.hwzc.commSeq;
                        garudaData.hwzc.obsLastCommTick = adcIsrTick;
                        /* Seqlock read of stepPeriodHR (Rule 13) */
                        uint32_t sp;
                        uint16_t s1, s2;
                        do {
                            s1 = garudaData.hwzc.writeSeq;
                            sp = garudaData.hwzc.stepPeriodHR;
                            s2 = garudaData.hwzc.writeSeq;
                        } while (s1 != s2 || (s1 & 1));
                        uint16_t obsPeriod = HWZC_SCCP2_TO_ADC(sp);
                        if (obsPeriod < 1) obsPeriod = 1;
                        BEMF_INTEG_ObserverOnComm(&garudaData, obsPeriod);
                        garudaData.hwzc.shadowHwzcSkipCount++;
                    }
                    BEMF_INTEG_ObserverTick(&garudaData, adcIsrTick,
                        garudaData.hwzc.obsLastCommTick);
                }
#endif /* FEATURE_BEMF_INTEGRATION */
            }
#endif /* FEATURE_ADC_CMP_ZC */

#if FEATURE_ADC_CMP_ZC
        cl_duty_control:
#endif

            /* Duty cycle control. */
            {
                uint32_t cap = garudaData.timing.zcSynced ? MAX_DUTY : RT_RAMP_DUTY_CAP;
                uint32_t mappedDuty;

#if FEATURE_DUTY_SLEW
                static uint16_t postSyncCounter = 0;
#endif

                if (!garudaData.timing.zcSynced)
                {
                    /* Pre-sync: hold duty at CL entry level.
                     * Don't let pot changes affect duty while forced
                     * commutation is trying to lock ZC — changing duty
                     * shifts the threshold and confuses detection. */
                    mappedDuty = garudaData.duty;
#if FEATURE_DUTY_SLEW
                    postSyncCounter = 0;
#endif
                }
                else
                {
#if FEATURE_DUTY_SLEW
                    if (postSyncCounter < RT_POST_SYNC_SETTLE_TICKS)
                        postSyncCounter++;
#endif
#if FEATURE_SPEED_PI
                    /* Speed PI: throttle controls TARGET SPEED via target
                     * stepPeriodHR; PI regulates duty to track. Replaces
                     * the direct throttle→duty scaling below. The output
                     * is updated per HWZC event (see SPEED_PI_OnZcEvent).
                     *
                     * SPEED_PI_Enable on first sync tick — bumpless transfer
                     * (integrator seeded from garudaData.duty). */
                    if (!garudaData.speedPi.enabled)
                        SPEED_PI_Enable(&garudaData);
                    mappedDuty = garudaData.speedPi.outputDuty;
#else
#if FEATURE_CL_DIFF_IDLE
                    /* Differential-low idle: throttle maps from the (sub-
                     * MIN_DUTY) diff floor — idle equilibrium ~3k, meeting the
                     * morph hand-off speed instead of slamming up to ~10k. */
                    mappedDuty = CL_DIFF_IDLE_FLOOR +
                        ((uint32_t)garudaData.throttle * (cap - CL_DIFF_IDLE_FLOOR)) / 4096;
#else
                    mappedDuty = RT_CL_IDLE_DUTY +
                        ((uint32_t)garudaData.throttle * (cap - RT_CL_IDLE_DUTY)) / 4096;
#endif
#endif
                }
#if FEATURE_CL_DIFF_IDLE
                if (mappedDuty < CL_DIFF_IDLE_FLOOR) mappedDuty = CL_DIFF_IDLE_FLOOR;
#elif FEATURE_CL_LOW_IDLE
                /* Lower CL idle floor (deadtime unchanged → no shoot-through risk;
                 * only shortens the H-pulse). Drops idle equilibrium + handoff gap. */
                if (mappedDuty < CL_LOW_IDLE_FLOOR) mappedDuty = CL_LOW_IDLE_FLOOR;
#else
                if (mappedDuty < MIN_DUTY) mappedDuty = MIN_DUTY;
#endif
                if (mappedDuty > cap) mappedDuty = cap;

#if FEATURE_DUTY_SLEW
                {
                    static uint32_t prevDuty = 0;
                    if (prevAdcState != ESC_CLOSED_LOOP)
                        prevDuty = garudaData.duty;

                    /* Post-sync settle: use reduced slew-up rate for
                     * POST_SYNC_SETTLE_MS after ZC lock. This prevents
                     * the motor from accelerating faster than the
                     * stepPeriod IIR can track on low-inertia motors.
                     * Normal rate: 2%/ms. Settle rate: 0.25%/ms (1/8). */
                    uint32_t upRate = RT_DUTY_SLEW_UP_RATE;
                    if (postSyncCounter < RT_POST_SYNC_SETTLE_TICKS)
                        upRate = RT_DUTY_SLEW_UP_RATE / RT_POST_SYNC_SLEW_DIVISOR;


                    int32_t delta = (int32_t)mappedDuty - (int32_t)prevDuty;
                    if (delta > 0)
                    {
                        if ((uint32_t)delta > upRate)
                            mappedDuty = prevDuty + upRate;
                    }
                    else if (delta < 0)
                    {
#if FEATURE_VBUS_REGEN_BRAKE
                        /* Vbus-aware regen brake — sticky version. Once engaged
                         * (Vbus rose above ON threshold during a regen event),
                         * stays engaged for minimum hold ticks even if Vbus
                         * briefly dips, then releases only when Vbus falls all
                         * the way to OFF threshold (wide hysteresis). This
                         * prevents the chatter that let duty keep dropping
                         * across regen pulses in the prior implementation. */
                        static bool regenBrakeActive = false;
                        static uint16_t regenBrakeHoldTicks = 0;
                        if (regenBrakeActive) {
                            if (regenBrakeHoldTicks > 0)
                                regenBrakeHoldTicks--;
                            if (regenBrakeHoldTicks == 0
                                && garudaData.vbusRaw < VBUS_REGEN_BRAKE_OFF_ADC)
                                regenBrakeActive = false;
                        } else {
                            if (garudaData.vbusRaw > VBUS_REGEN_BRAKE_ON_ADC) {
                                regenBrakeActive = true;
                                regenBrakeHoldTicks = VBUS_REGEN_BRAKE_MIN_TICKS;
                            }
                        }
                        uint32_t effectiveDownRate = RT_DUTY_SLEW_DOWN_RATE;
                        if (regenBrakeActive) {
                            /* Slow the slew-down rather than freezing entirely.
                             * Motor still decelerates during regen but at a rate
                             * the bus capacitor can absorb. Avoids the clumsy
                             * "can't decelerate" feel of a hard freeze. */
                            effectiveDownRate = RT_DUTY_SLEW_DOWN_RATE
                                              / VBUS_REGEN_BRAKE_SLEW_DIVISOR;
                            if (effectiveDownRate == 0) effectiveDownRate = 1;
                        }
#if FEATURE_HIGH_RPM_SLEW_DOWN
                        /* Proactive: at high eRPM, slew-down is limited
                         * regardless of Vbus state. Prevents the regen
                         * pulse before it spikes the bus. Reads HWZC's
                         * stepPeriodHR — at high RPM HWZC owns the period.
                         * Below the threshold or before HWZC engages,
                         * no penalty applied. */
                        if (garudaData.hwzc.enabled
                            && garudaData.hwzc.stepPeriodHR > 0
                            && garudaData.hwzc.stepPeriodHR
                               < HIGH_RPM_SLEW_THRESHOLD_HR) {
                            uint32_t highRpmRate = RT_DUTY_SLEW_DOWN_RATE
                                                 / HIGH_RPM_SLEW_DIVISOR;
                            if (highRpmRate == 0) highRpmRate = 1;
                            if (effectiveDownRate > highRpmRate)
                                effectiveDownRate = highRpmRate;
                        }
#endif
#if FEATURE_VBUS_EMERGENCY_HOLD
                        /* Emergency tier: above regen brake (28V), if
                         * Vbus hits 30V, FREEZE slew-down entirely so
                         * the rotor stops dumping regen energy into bus.
                         * Sticky hysteresis (30→27V) + 20ms min hold
                         * to prevent chatter. Releases when Vbus settles
                         * back below 27V AND min-hold has elapsed. */
                        static bool emergencyHoldActive = false;
                        static uint16_t emergencyHoldTicks = 0;
                        if (emergencyHoldActive) {
                            if (emergencyHoldTicks > 0)
                                emergencyHoldTicks--;
                            if (emergencyHoldTicks == 0
                                && garudaData.vbusRaw < VBUS_EMERGENCY_HOLD_OFF_ADC)
                                emergencyHoldActive = false;
                        } else {
                            if (garudaData.vbusRaw > VBUS_EMERGENCY_HOLD_ON_ADC) {
                                emergencyHoldActive = true;
                                emergencyHoldTicks = VBUS_EMERGENCY_HOLD_MIN_TICKS;
                            }
                        }
                        if (emergencyHoldActive)
                            effectiveDownRate = 0;
#endif
                        if ((uint32_t)(-delta) > effectiveDownRate)
                            mappedDuty = prevDuty - effectiveDownRate;
#else
                        if ((uint32_t)(-delta) > RT_DUTY_SLEW_DOWN_RATE)
                            mappedDuty = prevDuty - RT_DUTY_SLEW_DOWN_RATE;
#endif
                    }
                    prevDuty = mappedDuty;
                }
#endif
                if (garudaData.timing.stepPeriod <= RT_MIN_CL_ADC_STEP_PERIOD
                    && mappedDuty > garudaData.duty)
                {
                    mappedDuty = garudaData.duty;
                }

#if FEATURE_VBUS_SAG_LIMIT
                {
                    static uint16_t vbusFiltered = 0;
                    static bool vbusSagActive = false;

                    if (prevAdcState != ESC_CLOSED_LOOP)
                    {
                        vbusFiltered = garudaData.vbusRaw;
                        vbusSagActive = false;
                    }

