bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
                    /* IIR filter always runs (keeps filter warm during pre-sync) */
                    vbusFiltered = (uint16_t)(
                        ((uint32_t)vbusFiltered * 7 + garudaData.vbusRaw) >> 3);

#if FEATURE_PRESYNC_RAMP
                    /* Bypass sag limiter during pre-sync: at 12V CC-limited supply,
                     * vbus sags to ~636 ADC (8.9V) under startup load. With
                     * VBUS_SAG_THRESHOLD_ADC=900, the sag limiter would reduce
                     * RAMP_DUTY_CAP by ~26%, killing startup torque. Allow full
                     * startup duty until ZC sync is achieved. */
                    if (garudaData.timing.zcSynced)
                    {
#endif
                    if (!vbusSagActive && vbusFiltered < VBUS_SAG_THRESHOLD_ADC)
                        vbusSagActive = true;
                    else if (vbusSagActive && vbusFiltered > VBUS_SAG_RECOVERY_ADC)
                        vbusSagActive = false;

                    if (vbusSagActive)
                    {
                        uint32_t sagDepth = (vbusFiltered < VBUS_SAG_THRESHOLD_ADC) ?
                            (VBUS_SAG_THRESHOLD_ADC - vbusFiltered) : 0;
                        uint32_t reduction = (sagDepth * VBUS_SAG_GAIN) >> 4;
                        if (reduction >= mappedDuty)
                            mappedDuty = MIN_DUTY;
                        else
                            mappedDuty -= reduction;
                    }
#if FEATURE_PRESYNC_RAMP
                    }
                    else
                    {
                        vbusSagActive = false;  /* Reset so it re-evaluates on sync */
                    }
#endif

#if FEATURE_CL_LOW_IDLE
                    /* respect the lowered CL idle floor (this sag block's
                     * re-floor would otherwise clobber CL_LOW_IDLE_FLOOR
                     * back up to MIN_DUTY every tick) */
                    if (mappedDuty < CL_LOW_IDLE_FLOOR)
                        mappedDuty = CL_LOW_IDLE_FLOOR;
#elif FEATURE_CL_DIFF_IDLE
                    /* differential-low idle: don't re-floor up to MIN_DUTY */
                    if (mappedDuty < CL_DIFF_IDLE_FLOOR)
                        mappedDuty = CL_DIFF_IDLE_FLOOR;
#else
                    if (mappedDuty < MIN_DUTY)
                        mappedDuty = MIN_DUTY;
#endif
                }
#endif

#if FEATURE_HW_OVERCURRENT
                /* Software bus current soft limiter — proportional duty reduction.
                 * Ramps down duty smoothly BEFORE CMP3/CLPCI hardware trips. */
                if (garudaData.ibusRaw > OC_SW_LIMIT_ADC
                    && mappedDuty > MIN_DUTY)   /* guard: below MIN_DUTY (diff idle)
                                                 * the subtraction would underflow
                                                 * unsigned and RAISE duty under OC */
                {
                    uint16_t excess = garudaData.ibusRaw - OC_SW_LIMIT_ADC;
                    uint16_t range = RT_OC_CMP3_DAC_VAL - OC_SW_LIMIT_ADC;
                    if (range == 0) range = 1;
                    uint32_t reduction = ((uint32_t)excess * (mappedDuty - MIN_DUTY)) / range;
                    if (reduction >= mappedDuty - MIN_DUTY)
                        mappedDuty = MIN_DUTY;
                    else
                        mappedDuty -= reduction;
                }
#endif

#if FEATURE_CL_SOFT_ENTRY
                /* Option A — soft OL->CL hand-off. MORPH leaves the duty already
                 * at operating level (~6%), so a slew-RATE limiter has no upward
                 * step to catch. Instead OWN an explicit cap that starts at
                 * MIN_DUTY on CL entry and ramps up gently, so the motor walks
                 * from the low-BEMF hand-off speed (~3k) to the idle equilibrium
                 * (~14k) with bounded current instead of the ~22A torque slam.
                 * Final cap (after OC limiter) so protections still win; only
                 * limits the UPPER bound during the entry window. */
                {
                    static uint32_t softCap = 0;
                    static uint16_t softCtr = 0;
                    if (prevAdcState != ESC_CLOSED_LOOP) {
                        softCtr  = 0;
                        softCap  = MIN_DUTY;        /* begin LOW, ignore morph-exit duty */
                    }
                    if (softCtr < CL_SOFT_ENTRY_TICKS) {
                        softCtr++;
                        uint32_t step = RT_DUTY_SLEW_UP_RATE / CL_SOFT_ENTRY_DIVISOR;
                        if (step == 0) step = 1;
                        softCap += step;
                        if (mappedDuty > softCap)
                            mappedDuty = softCap;
                    }
                }
#endif
#if FEATURE_IF_BRIDGE
                /* Option D — I-f current-limited OL->CL hand-off bridge.
                 * Ramp duty up from MIN_DUTY, but back off whenever bus current
                 * exceeds the cap, so the motor accelerates from the (low-BEMF)
                 * hand-off speed to the idle equilibrium at BOUNDED current
                 * instead of the structural ~22A slam. Motor-agnostic: the cap
                 * is the only knob. Only ever LOWERS mappedDuty (exits, leaving
                 * normal control, once the regulated duty catches up to demand),
                 * so OC/regen/OV protections above still win. */
                {
                    static uint32_t ifDuty = 0;
                    static uint16_t ifCtr  = 0;
                    static uint16_t ifPeak = 0;
                    static bool ifActive   = false;
                    if (prevAdcState != ESC_CLOSED_LOOP) {
                        ifActive = true;
                        ifDuty   = MIN_DUTY;
                        ifCtr    = 0;
                        ifPeak   = 0;
                    }
                    if (ifActive) {
                        ifCtr++;
                        /* back off on current MAGNITUDE (both motoring + and regen -
                         * excursions); the bus current swings negative during the
                         * unlocked hand-off, which a signed compare would miss.
                         * ibusRaw is sampled at the PWM valley (~0 there), so the real
                         * hand-off current registers only as a RECURRING spike that a
                         * single per-tick read mostly misses — PEAK-HOLD it (decaying)
                         * so the back-off actually sees the −22A and reacts. */
                        int32_t iInst = (int32_t)garudaData.ibusRaw
                                      - (int32_t)OC_BIAS_COUNTS;
                        if (iInst < 0) iInst = -iInst;
                        if ((uint16_t)iInst > ifPeak)
                            ifPeak = (uint16_t)iInst;
                        else
                            ifPeak -= (ifPeak >> IF_BRIDGE_PEAK_DECAY_SHIFT);
                        int32_t iMag = (int32_t)ifPeak;
                        if (iMag > IF_BRIDGE_LIMIT_DELTA) {
                            /* over the current cap — back off fast */
                            if (ifDuty > MIN_DUTY + IF_BRIDGE_DOWN_RATE)
                                ifDuty -= IF_BRIDGE_DOWN_RATE;
                            else
                                ifDuty = MIN_DUTY;
                        } else {
                            /* under the cap — ramp up toward normal demand */
                            ifDuty += IF_BRIDGE_UP_RATE;
                        }
                        /* Never exceed the normal demand, but DON'T exit just
                         * because the ramp caught up — a single PWM-gated low
                         * current sample must not let the bridge bail before the
                         * real overcurrent develops. Stay active for the whole
                         * window; once the motor reaches idle, ifDuty simply sits
                         * at the demand (harmless) until the window expires. */
                        if (ifDuty > mappedDuty)
                            ifDuty = mappedDuty;
                        if (ifCtr >= IF_BRIDGE_TICKS)
                            ifActive = false;        /* window elapsed -> hand back */
                        mappedDuty = ifDuty;         /* apply the bounded-current duty */
                    }
                }
#endif

#if FEATURE_CL_ENTRY_GLIDE
                /* Entry glide: ramp effective duty linearly from the matched
                 * engage level to MIN_DUTY (~320ms), overriding the mapping
                 * (placed LAST so the MIN_DUTY floors above can't undo the
                 * sub-MIN cap). Speed follows quasi-statically → near-linear
                 * climb to the MIN_DUTY equilibrium at a few amps instead of
                 * the ballistic 22A slam. At MIN_DUTY, force-swap to the
                 * conventional waveform — bit-identical baseline after. */
                if (s_glideActive)
                {
                    if (++s_glideDivCtr >= CL_GLIDE_DIV)
                    {
                        s_glideDivCtr = 0;
                        s_glideDuty++;
                    }
                    if (s_glideDuty >= MIN_DUTY)
                    {
                        s_glideActive = 0;
                        if (g_pwmDiffLow)
                        {
                            /* hand back to the baseline waveform (HWZC then
                             * re-enables via the normal crossover logic) */
                            g_pwmDiffLow = 0;
                            HAL_PWM_SetCommutationStep(garudaData.currentStep);
                        }
                    }
                    else if (mappedDuty > s_glideDuty)
                    {
                        mappedDuty = s_glideDuty;
                    }
                }
#endif
                garudaData.duty = mappedDuty;

#if FEATURE_CL_DIFF_IDLE
                /* Drive-mode management. garudaData.duty is EFFECTIVE duty in
                 * both modes (identical line-line volts for duty ≥ MIN_DUTY),
                 * so the swaps are voltage-seamless; only the low phase's
                 * waveform class changes. Hysteresis prevents IOCON churn. */
                {
                    /* (CL entry is handled by the coast-listen block at the
                     * top of the case — it engages diff mode synced.) */
                    if (g_pwmDiffLow
                             && garudaData.duty >= MIN_DUTY
                                + (MIN_DUTY / CL_DIFF_EXIT_HYST_DIV))
                    {
                        /* throttle demand exceeds the conventional floor —
                         * swap to the proven override-LOW waveform (HWZC
                         * re-enables via the normal crossover logic) */
                        g_pwmDiffLow = 0;
                        HAL_PWM_SetCommutationStep(garudaData.currentStep);
                    }
                    else if (!g_pwmDiffLow && garudaData.duty < MIN_DUTY)
                    {
                        /* demand back below the conventional floor — re-enter */
                        g_pwmDiffLow = 1;
                        HAL_PWM_SetCommutationStep(garudaData.currentStep);
#if FEATURE_ADC_CMP_ZC
                        garudaData.hwzc.enablePending = false;
                        if (garudaData.hwzc.enabled)
                        {
                            /* hand ZC back to the SW valley detector, re-seeded
                             * from HWZC's period (the proven fallback path) */
                            HWZC_Disable(&garudaData);
                            garudaData.hwzc.fallbackPending = true;
                        }
#endif
                    }
                }
#endif

#if FEATURE_HANDOFF_CHOP
                /* Sub-MIN_DUTY current bound via the CMP3 HARDWARE chop, not duty.
                 * Hold a LOW chop threshold for a window at CL entry so the
                 * cycle-by-cycle CLPCI truncates each pulse at OC_CMP3_HANDOFF_MA
                 * — bounding the phase current (and its −freewheel bus pulse)
                 * regardless of duty/MIN_DUTY, with no regen oscillation. Other
                 * state transitions also write the CMP3 DAC (zcSync etc.), so we
                 * RE-ASSERT every tick to own the threshold for the whole window,
                 * then restore the operational value once. Armed only at CL entry;
                 * align/OL/morph keep STARTUP_DAC so their torque isn't chopped. */
                {
                    static uint16_t hcCtr = 0;
                    static bool hcActive = false;
                    if (prevAdcState != ESC_CLOSED_LOOP) {
                        hcActive = true;
                        hcCtr = 0;
                    }
                    if (hcActive) {
                        HAL_CMP3_SetThreshold(OC_CMP3_HANDOFF_DAC);
                        if (++hcCtr >= HANDOFF_CHOP_TICKS) {
                            hcActive = false;
                            HAL_CMP3_SetThreshold(RT_OC_CMP3_DAC_VAL);
                        }
                    }
                }
#endif
            }
            HAL_PWM_SetDutyCycle(garudaData.duty);
            break;
        }
#else  /* !FEATURE_BEMF_CLOSED_LOOP — Phase 1 open-loop path */
        case ESC_CLOSED_LOOP:
            HAL_PWM_SetDutyCycle(garudaData.duty);
            break;
#endif

        case ESC_BRAKING:
            break;

        case ESC_RECOVERY:
            /* PWM already disabled on entry — coast-down handled in Timer1 */
            break;

        case ESC_FAULT:
            HAL_MC1PWMDisableOutputs();
            break;
    }
#endif /* !FEATURE_FOC && !FEATURE_FOC_V2 && !FEATURE_FOC_V3 && !FEATURE_FOC_AN1078 — end of 6-step state machine */

#if FEATURE_BEMF_CLOSED_LOOP
    /* Track state for transition detection (must be last before flag clear).
     * Use entryState (not garudaData.state) so mid-ISR state changes
     * (e.g. morph→CL) are visible on the NEXT tick. */
#if FEATURE_SPEED_PI
    /* Disable speed PI when leaving CL state. Cleanup so SPEED_PI_OnZcEvent
     * (called from HWZC ISR) no-ops until next CL re-entry. Bumpless on
     * re-enable because Enable seeds integrator from current duty. */
    if (entryState == ESC_CLOSED_LOOP
        && garudaData.state != ESC_CLOSED_LOOP
        && garudaData.speedPi.enabled)
        SPEED_PI_Disable(&garudaData);
#endif
    prevAdcState = entryState;
#endif

    /* X2CScope: sample variables at ADC rate (24kHz) */
#ifdef ENABLE_DIAGNOSTICS
    DiagnosticsStepIsr();
#endif

    /* Clear interrupt flag AFTER reading all buffers (matches reference) */
    GARUDA_ClearADCIF();
}

/**
 * @brief Timer1 ISR — 100us tick.
 * Handles: heartbeat LED, board service, commutation timing for
 * align/ramp states, 1ms system tick.
 */
void __attribute__((__interrupt__, no_auto_psv)) _T1Interrupt(void)
{
    /* Heartbeat LED — toggle at ~2Hz (250ms) */
    heartbeatCounter++;
    if (heartbeatCounter >= HEART_BEAT_LED_COUNT)
    {
        heartbeatCounter = 0;
        if (LED1 == 1)
            LED1 = 0;
        else
            LED1 = 1;
    }

    /* Board service step (drives button debounce at 1ms) */
    BoardServiceStepIsr();

    /* 1ms system tick sub-counter (10 x 100us = 1ms) */
    msSubCounter++;
    if (msSubCounter >= 10)
    {
        msSubCounter = 0;
        garudaData.systemTick++;
    }

