bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
    /* State-specific processing at 100us rate */
    switch (garudaData.state)
    {
        case ESC_IDLE:
            /* Nothing — waiting for button press in main loop */
            break;

        case ESC_ARMED:
#if FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3 || FEATURE_FOC_AN1078
            /* FOC: arming handled in ADC ISR slow loop (1kHz) to avoid
             * cross-ISR races. Timer1 is a no-op for ESC_ARMED with FOC. */
            break;
#else
            /* Verify throttle stays at zero for ARM_TIME */
            if (garudaData.throttle < ARM_THROTTLE_ZERO_ADC)
            {
                garudaData.armCounter++;
                if (garudaData.armCounter >= ARM_TIME_COUNTS)
                {
                    /* Armed successfully — transition to ALIGN.
                     * Init before state change: ADC ISR (prio 6) can
                     * preempt Timer1 (prio 5) between the two lines. */
                    STARTUP_Init(&garudaData);
#if FEATURE_AM32_STARTUP
                    /* AM32-style: no align, no ramp. Seed the listener's
                     * period guess and enter CL; the ADC-ISR entry block
                     * does the one blind kick + HWZC arm (startMotor()
                     * semantics, AM32 main.c:977). */
                    garudaData.rampStepPeriod =
                        (uint16_t)ERPM_TO_STEP_TICKS(AM32_START_SEED_ERPM);
                    g_am32EntryPending = 1;
#if FEATURE_HW_OVERCURRENT
                    HAL_CMP3_SetThreshold(RT_OC_CMP3_DAC_VAL);
#endif
                    garudaData.state = ESC_CLOSED_LOOP;
#elif FEATURE_IF_STARTUP
                    /* I-f self-aligns from the clean override-low bridge state.
                     * STARTUP_Init's SineInit briefly wrote sine duties + released
                     * overrides; IF_StartupInit (same tick) overwrites to balanced
                     * 0V before any sine duty latches, so the sine HOLD never runs
                     * and there's no sine→SVPWM handover. */
                    IF_StartupInit();
                    garudaData.state = ESC_IF_RAMP;
#else
                    garudaData.state = ESC_ALIGN;
#endif
                    LED2 = 1; /* Motor running indicator */
                }
            }
            else
            {
                garudaData.armCounter = 0; /* Reset if throttle not zero */
            }
            break;
#endif

        case ESC_ALIGN:
#if FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3 || FEATURE_FOC_AN1078
            /* FOC: alignment handled in ADC ISR. Timer1 is a no-op. */
            break;
#elif FEATURE_SINE_STARTUP
            /* I-f path bypasses ALIGN entirely (ARMED→IF_RAMP), so this only
             * runs in the non-IF build. */
            if (STARTUP_SineAlign(&garudaData))
            {
#if FEATURE_PLL_STARTUP
                /* PLL-from-align: no OL ramp, no morph. Seed the slow
                 * initial period, flag the blind schedule, and enter CL —
                 * the ADC-ISR entry block engages 6-step + HWZC there. */
                garudaData.rampStepPeriod =
                    (uint16_t)ERPM_TO_STEP_TICKS(PLL_START_ERPM0);
                garudaData.hwzc.pllStartActive = 1;
                garudaData.hwzc.pllStartGood = 0;
                garudaData.hwzc.pllPrevCap = 0;
#if FEATURE_HW_OVERCURRENT
                HAL_CMP3_SetThreshold(RT_OC_CMP3_DAC_VAL);
#endif
                garudaData.state = ESC_CLOSED_LOOP;
#else
                garudaData.state = ESC_OL_RAMP;
#endif
            }
            break;
#else
            if (STARTUP_Align(&garudaData))
            {
                garudaData.state = ESC_OL_RAMP;
                garudaData.rampCounter = garudaData.rampStepPeriod;
            }
            break;
#endif

#if FEATURE_IF_STARTUP
        case ESC_IF_RAMP:
            /* I-f spin-up is driven entirely in the ADC ISR; Timer1 is a no-op. */
            break;
#endif

        case ESC_OL_RAMP:
#if FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3 || FEATURE_FOC_AN1078
            /* FOC: I/f ramp handled in ADC ISR. Timer1 is a no-op. */
            break;
#elif DIAGNOSTIC_MANUAL_STEP
            garudaData.state = ESC_CLOSED_LOOP;
            break;
#elif FEATURE_SINE_STARTUP
            if (STARTUP_SineRamp(&garudaData))
            {
                /* Sine ramp complete → enter waveform morph.
                 * rampStepPeriod synced from sine eRPM in MorphInit. */
                STARTUP_MorphInit(&garudaData);
#if FEATURE_HW_OVERCURRENT
                /* Lower CMP3 from startup (22A) to operational (12A).
                 * Morph convergence can spike current above the board PCI
                 * threshold (~15A) but below CMP3 startup. Without this,
                 * CMP3 never trips and the board PCI hard-faults. */
                HAL_CMP3_SetThreshold(RT_OC_CMP3_DAC_VAL);
#endif
#if FEATURE_SKIP_MORPH && FEATURE_CL_COAST_VERIFY
                if (garudaData.direction == 0)
                {
                    /* Skip the morph: the CL-entry coast-listen measures the
                     * TRUE sector/period from clean coast BEMF — no trap
                     * converge, no windowed-Hi-Z grind (deletes the morph
                     * current kick). MorphInit above already did the critical
                     * rampStepPeriod sync; the morph fields it set go unused.
                     * Next ADC tick: normal CL entry init (prev==OL_RAMP →
                     * BEMF_ZC_Init path), then CL_CoastBegin cuts the bridge. */
                    garudaData.sine.active = false;
                    garudaData.state = ESC_CLOSED_LOOP;
                    break;
                }
#endif
                garudaData.state = ESC_MORPH;
            }
            break;
#else
#if FEATURE_PRESYNC_RAMP
            /* Skip blind forced ramp. Enter CL directly with slow initial
             * step period. ADC ISR pre-sync handles feedback-gated
             * acceleration with ZC detection in parallel. */
            garudaData.duty = RT_RAMP_DUTY_CAP;
            garudaData.state = ESC_CLOSED_LOOP;
#else
            if (STARTUP_OpenLoopRamp(&garudaData))
            {
                garudaData.state = ESC_CLOSED_LOOP;
            }
#endif
            break;
#endif

